README.org
# -*- evil-shift-width: 2; fill-column: 80; comment-column: 75; -*-
#+title: Emacs configuration with Org Mode
#+author: Yuriy Artemyev
#+email: anuvyklack@gmail.com
#+startup: content
#+property: header-args :tangle "./init.el" :results silent
#                       :tangle (identity user-init-file)
 
* =init.el= preamble
Good Emacs Lisp file starts with such commentary:

#+begin_src emacs-lisp
;;; init.el --- Emacs main configuration file -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-
;;;
;;; Commentary:
;;; Emacs config by Yuriy Artemyev.
;;; This file was automatically generated by `org-babel-tangle'.
;;; Do not change this file.  Main config is located in .config/emacs/README.org
;;;
;;; Code:
#+end_src

* =early-init.el=
:properties:
:header-args+: :tangle "./early-init.el"
:end:
These settings are going into different init file: =earli-init.el=.
We are going to use some speedup tricks from [[https://github.com/hlissner/doom-emacs][doom-emacs]] here.
** Preamble

#+begin_src emacs-lisp
;;; early-init.el --- early configurations -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-
;;;
;;; Commentary:
;;; Emacs confi by Andrey Orst.
;;; This file was automatically generated by `org-babel-tangle'.
;;; Do not change this file.  Main config is located in .config/emacs/README.org
;;;
;;; Code:
#+end_src

** COMMENT Garbage Collection
The main problem  with Emacs startup is garbage  collection system. It
is invoked so many times on startup that it causes quite big impact on
startup time.   We're talking  /seconds/.  One can  raise limit  when to
trigger garbage collection, but this will end up in unpleasant editing
experience. So I'm  declaring these variables to  store default values
for the GC, to restore them after initialization is finished:

#+begin_src emacs-lisp
(defvar aorst--gc-cons-threshold gc-cons-threshold)
(defvar aorst--gc-cons-percentage gc-cons-percentage)
(defvar aorst--file-name-handler-alist file-name-handler-alist)
#+end_src

Now we can tweak CG. We need to raise threshold to prevent it running:

#+begin_src emacs-lisp
(setq-default gc-cons-threshold 402653184
            gc-cons-percentage 0.6
            inhibit-compacting-font-caches t
            message-log-max 16384
            file-name-handler-alist nil)
#+End_src

Then we need  a hook that restores initial  values once initialization
done:

#+begin_src emacs-lisp
(add-hook 'after-init-hook
        (lambda ()
          (setq gc-cons-threshold aorst--gc-cons-threshold
                gc-cons-percentage aorst--gc-cons-percentage
                file-name-handler-alist aorst--file-name-handler-alist)))
#+end_src

** Native Compiled Emacs Lisp
There's a very interesting project that I'm currently using, called [[http://akrl.sdf.org/gccemacs.html][gccemacs]].
It provides a way to compile Emacs Lisp into native code, thus making Emacs
much more robust and snappy. In order to compile everything that Emacs loads
asynchronously we can set this variable to =true=.

#+begin_src emacs-lisp
(defvar comp-deferred-compilation)
(setq comp-deferred-compilation t)
#+end_src

This way I can compile Emacs from source as I usually do, and then continue
using it as normal, and Emacs will do it's native compilation in background
for every loaded package. That's amazing!

** =straight.el= and =use-package=
Straight is an alternative way  to manage package installations. It is
a purely  functional package  manager. It  installs packages  from Git
repositories listed on ELPA and MELPA, or from Git URL.

=Straight.el= settings:

#+begin_src emacs-lisp
  (custom-set-variables
   '(straight-repository-branch "develop")
   '(straight-check-for-modifications '(check-on-save find-when-checking))
   '(straight-vc-git-default-clone-depth 1)
   ;; '(straight-use-package-by-default t) 
  )
#+end_src

Bootstrap =Straight.el=:

#+begin_src emacs-lisp
(defvar bootstrap-version)
(defvar straight-repository-branch)
(setq straight-repository-branch "develop")
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+end_src

Now we can install =use-package= with it:

#+begin_src emacs-lisp
  (straight-use-package 'use-package)
#+end_src

#+begin_src emacs-lisp
  ;; (setq use-package-always-defer t
  ;;       ;; use-package-minimum-reported-time .001
  ;;       ;; use-package-verbose t
  ;;       ;; use-package-compute-statistics t
  ;; )
#+end_src

** Garbage Collector Magic Hack
[[https://gitlab.com/koral/gcmh][Source]]

#+begin_src emacs-lisp
  (use-package gcmh
    :straight t 
    :init
    (gcmh-mode 1))
#+end_src

** COMMENT User Interface AORST
Prevent the glimpse of un-styled  Emacs by disabling these UI elements
early.

#+begin_src emacs-lisp
(setq initial-frame-alist '((width . 170)
                            (height . 56)
                            (tool-bar-lines . 0)
                            (left-fringe . 0)
                            (right-fringe . 0)
                            (bottom-divider-width . 0)
                            (right-divider-width . 1))
      default-frame-alist initial-frame-alist)
#+end_src

Resizing frame is also expensive so we inhibit it, and latest patch to
Emacs  introduced =x-gtk-resize-child-frames=  variable  that fixes  the
issue  with  child frames  not  being  resized correctly  under  GNOME
Shell, so let's set it to =resize-mode=.

#+begin_src emacs-lisp
(setq frame-inhibit-implied-resize t
    x-gtk-resize-child-frames 'resize-mode)
#+end_src

** COMMENT Visual settings old

Arbitrary frame size and position.
Useful functions:
 - set-frame-height
 - set-frame-width
 - set-frame-size
 - set-frame-position

#+begin_src emacs-lisp
(when window-system
  (set-frame-size (selected-frame) 120 35)
  (set-frame-position (selected-frame) 100 70))

(setq scroll-preserve-screen-position nil)

;; ;; Set size parameters of ‘initial-frame-alist’ or
;; ;; ‘default-frame-alist’. E.g.,
;; (add-to-list 'default-frame-alist '(height . 24))
;; (add-to-list 'default-frame-alist '(width . 80))

;; (set-frame-font "Liga Inconsolata LGC NF-10.6")
;; (set-frame-font "Liga Inconsolata LGC NF OT-10.5")

;; (set-frame-font "PragmataPro-11.5")
(set-frame-font "PragmataPro Mono-11.7:antialias=subpixel")
;; (set-frame-font "PragmataPro Mono-11.7:antialias=natural")
;; (set-frame-font "Pragmata Pro Mono-11.7:antialias=natural")

;; (set-frame-font "Symbola-11.7")

 ;; set-fontset-font
;; (set-frame-font "Victor Mono-10.7")
;; (set-frame-font "Operator Mono-11.5")
;; (set-frame-font "Input-11.5")
;; (set-frame-font "Fira Code-10.7")

(setq-default frame-background-mode 'dark)

(setq frame-resize-pixelwise t)

;; ;; Fullscreen by default, as early as possible.
;; (add-to-list 'default-frame-alist '(fullscreen . maximized))

;; Disable otiose GUI settings: they just waste space.
;; fringe-mode is especially ruinous performance-wise.
(when (window-system)
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (tooltip-mode -1)
  ;; (fringe-mode 10)  ;; Margin from the frame in pixels
  (fringe-mode -1)  ;; Margin from the frame in pixels
  (blink-cursor-mode -1)
)

;; (global-linum-mode t)  ;; show line numbers

;; (global-hl-line-mode) ;; highlight the line with cursor

;; Say to Emacs that it should split frame vertically rather than
;; horizontally when Emacs has the choice (eg when bringing up help).
(setq split-height-threshold nil)
;; How many columns emacs should have in a frame to split a window
;; vertically but not horizontally.
(setq split-width-threshold 150)

(add-to-list 'display-buffer-alist
  ;; '("*Help*" display-buffer-same-window)
  ;; Open *Help* buffers into vertical split on the left
  '("*Help"
   (display-buffer-reuse-window display-buffer-in-side-window)
   (side . left)
   (slot . 1)
   (window-width . 0.5)
   (reusable-frames . nil))
)
#+end_src

** Early =package.el= settings
=package.el= initialization is expensive so we disable it at startup:

#+begin_src emacs-lisp
(setq package-enable-at-startup nil)
#+end_src

** ~(provide 'early-init)~
This concludes the =early-init.el= file.

#+begin_src emacs-lisp
(provide 'early-init)
;;; early-init.el ends here
#+end_src

** COMMENT Loading =early-init.el= in Emacs 26 and earlier
:properties:
:header-args+: :tangle "./init.el"
:end:
Before Emacs  27 there were  no such thing  as =eraly-init.el=, so  if I
will use  older Emacs  with this configuration  it will  miss settings
that are done there. This code manually loads this file in such case:

#+begin_src emacs-lisp
  (unless (featurep 'early-init)
    (message "not early-init")
    (load (expand-file-name "early-init" user-emacs-directory)))
#+end_src

* Variables

#+begin_src emacs-lisp
(setq init-file (expand-file-name "init.el" user-emacs-directory)
      config-org-file (expand-file-name "README.org" user-emacs-directory))
#+end_src

* User Interface

Arbitrary frame size and position. Use functions `set-frame-height`,
`set-frame-width`, `set-frame-size`, and `set-frame-position`.

#+begin_src emacs-lisp
(when window-system
  ;; (set-frame-size (selected-frame) 92 35)
  (set-frame-size (selected-frame) 145 53)
  (set-frame-position (selected-frame) 500 70)
)

;; ;; Set size parameters of ‘initial-frame-alist’ or
;; ;; ‘default-frame-alist’. E.g.,
;; (add-to-list 'default-frame-alist '(height . 24))
;; (add-to-list 'default-frame-alist '(width . 80))

;; Iosevka is my font of choice, but don't freak out if it's present.
;; (ignore-errors (set-frame-font "Iosevka-13"))
(set-frame-font "Liga Inconsolata LGC NF OT-12.0")
;; (set-frame-font "PragmataPro-10.5")

;; (setq-default frame-background-mode 'dark)
;; 
;; (setq frame-resize-pixelwise t)
;; 
;; ;; ;; Fullscreen by default, as early as possible.
;; ;; (add-to-list 'default-frame-alist '(fullscreen . maximized))
;; 
;; ;; Disable otiose GUI settings: they just waste space.
;; ;; fringe-mode is especially ruinous performance-wise.
;; (when (window-system)
;;   (tool-bar-mode -1)
;;   (menu-bar-mode -1)
;;   (scroll-bar-mode -1)
;;   (tooltip-mode -1)
;;   ;; (fringe-mode 10)  ;; Margin from the frame in pixels
;;   (fringe-mode -1)  ;; Margin from the frame in pixels
;;   (blink-cursor-mode -1)
;; )
;; 
;; ;; (global-linum-mode t)  ;; show line numbers
;; 
;; ;; (global-hl-line-mode) ;; highlight the line with cursor
;; 
;; ;; Say to Emacs that it should split frame vertically rather than
;; ;; horizontally when Emacs has the choice (eg when bringing up help).
;; (setq split-height-threshold nil)
;; ;; How many columns emacs should have in a frame to split a window
;; ;; vertically but not horizontally.
;; (setq split-width-threshold 150)
;; 
;; (add-to-list 'display-buffer-alist
;;   ;; '("*Help*" display-buffer-same-window)
;;   ;; Open *Help* buffers into vertical split on the left
;;   '("*Help"
;;    (display-buffer-reuse-window display-buffer-in-side-window)
;;    (side . left)
;;    (slot . 1)
;;    (window-width . 0.5)
;;    (reusable-frames . nil))
;; )
#+end_src

* Customize
Store customize settgins in separate file.

#+begin_src emacs-lisp
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file) (load custom-file))
#+end_src

