init.el
;;; init.el --- Emacs main configuration file -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-
;;;
;;; Commentary:
;;; Emacs config by Yuriy Artemyev.
;;; This file was automatically generated by `org-babel-tangle'.
;;; Do not change this file.  Main config is located in .config/emacs/README.org
;;;
;;; Code:

(setq init-file (expand-file-name "init.el" user-emacs-directory)
      config-org-file (expand-file-name "README.org" user-emacs-directory))

(when window-system
  ;; (set-frame-size (selected-frame) 92 35)
  (set-frame-size (selected-frame) 145 53)
  (set-frame-position (selected-frame) 500 70)
)

;; ;; Set size parameters of ‘initial-frame-alist’ or
;; ;; ‘default-frame-alist’. E.g.,
;; (add-to-list 'default-frame-alist '(height . 24))
;; (add-to-list 'default-frame-alist '(width . 80))

;; Iosevka is my font of choice, but don't freak out if it's present.
;; (ignore-errors (set-frame-font "Iosevka-13"))
(set-frame-font "Liga Inconsolata LGC NF OT-12.0")
;; (set-frame-font "PragmataPro-10.5")

;; (setq-default frame-background-mode 'dark)
;; 
;; (setq frame-resize-pixelwise t)
;; 
;; ;; ;; Fullscreen by default, as early as possible.
;; ;; (add-to-list 'default-frame-alist '(fullscreen . maximized))
;; 
;; ;; Disable otiose GUI settings: they just waste space.
;; ;; fringe-mode is especially ruinous performance-wise.
;; (when (window-system)
;;   (tool-bar-mode -1)
;;   (menu-bar-mode -1)
;;   (scroll-bar-mode -1)
;;   (tooltip-mode -1)
;;   ;; (fringe-mode 10)  ;; Margin from the frame in pixels
;;   (fringe-mode -1)  ;; Margin from the frame in pixels
;;   (blink-cursor-mode -1)
;; )
;; 
;; ;; (global-linum-mode t)  ;; show line numbers
;; 
;; ;; (global-hl-line-mode) ;; highlight the line with cursor
;; 
;; ;; Say to Emacs that it should split frame vertically rather than
;; ;; horizontally when Emacs has the choice (eg when bringing up help).
;; (setq split-height-threshold nil)
;; ;; How many columns emacs should have in a frame to split a window
;; ;; vertically but not horizontally.
;; (setq split-width-threshold 150)
;; 
;; (add-to-list 'display-buffer-alist
;;   ;; '("*Help*" display-buffer-same-window)
;;   ;; Open *Help* buffers into vertical split on the left
;;   '("*Help"
;;    (display-buffer-reuse-window display-buffer-in-side-window)
;;    (side . left)
;;    (slot . 1)
;;    (window-width . 0.5)
;;    (reusable-frames . nil))
;; )

(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file) (load custom-file))
