README.org
* General settings

Better-defaults:
#+begin_src emacs-lisp
  (use-package better-defaults
    :straight t)
#+end_src

#+begin_src emacs-lisp
  (setq-default indent-tabs-mode nil   ; no tab characters in files
                tab-width 4
                comment-empty-lines t  ; comment empty lines
                ;; При обращении к файлу уже открытому в буфере Emacs-а
                ;; по другому имени (по символической или жёсткой
                ;; ссылке), Emacs откроет уже существующий буфер, а не
                ;; создасть новый.
                find-file-existing-other-name t
                ;; delete-indentation t
  )
#+end_src

* Libraries
** emacs-async
[[https://github.com/jwiegley/emacs-async][Source]]
=async.el= is a module for doing asynchronous processing in Emacs.

#+begin_src emacs-lisp
  (use-package async
    :straight t)
#+end_src

* Color themes
** Doom-themes

#+begin_src emacs-lisp
  (use-package doom-themes
    :straight t
    :config
    ;; Global settings (defaults)
    (setq
      doom-themes-enable-bold nil  ; if nil, bold is universally disabled
      doom-themes-enable-italic t) ; if nil, italics is universally disabled
    (load-theme 'doom-one t)
    ;; (load-theme 'doom-gruvbox t)
    ;; (load-theme 'doom-material t)
    ;; (load-theme 'doom-peacoc t)
    ;; (load-theme 'doom-nova t)
  )
#+end_src

** COMMENT Tron

#+begin_src emacs-lisp
  (use-package tron-legacy-theme
    :straight t
    :config
      (setq tron-legacy-theme-vivid-cursor t)
      (setq tron-legacy-theme-softer-bg t)
      (load-theme 'tron-legacy t)
  )
#+end_src

Change comment color:

#+begin_src emacs-lisp
(custom-theme-set-faces
  'tron-legacy
  '(font-lock-comment-face ((t (:foreground "#758b9c" :slant normal))))
  ;; '(font-lock-comment-face ((t (:foreground "#758b9c" :slant italic))))
  ;; '(font-lock-comment-face ((t (:foreground "#6a8193" :slant italic))))
)
#+end_src

** COMMENT Afternoon

#+begin_src emacs-lisp
  (use-package afternoon-theme
    :straight (:depth 1)
    :config
    (load-theme 'afternoon t)
  )
#+end_src

** COMMENT Elemental-theme

#+begin_src emacs-lisp
  (use-package elemental-theme
    :straight (:host github :repo "zk-phi/elemental-theme"))
#+end_src

** COMMENT Gruvbox

#+begin_src emacs-lisp
  (use-package gruvbox-theme
    :straight t
    :config
    ;; (load-theme 'gruvbox t)
    ;; (load-theme 'gruvbox-dark-soft t)
    (load-theme 'gruvbox-dark-hard t)
  )
#+end_src

** COMMENT One Dark

#+begin_src emacs-lisp
  (use-package atom-one-dark-theme
    :straight t
    :config
    (load-theme 'atom-one-dark t))
#+end_src

Change comment color:

#+begin_src emacs-lisp
(custom-theme-set-faces
  'atom-one-dark
  '(font-lock-comment-face ((t (:foreground "#758b9c" :slant normal))))
  ;; '(font-lock-comment-face ((t (:foreground "#758b9c" :slant italic))))
  ;; '(font-lock-comment-face ((t (:foreground "#6a8193" :slant italic))))
)
#+end_src

** COMMENT Zerodark

#+begin_src emacs-lisp
  (use-package zerodark-theme
    :straight t
    :config
    (load-theme 'zerodark t)
    ;; Optionally setup the modeline
    (zerodark-setup-modeline-format)
  )
#+end_src

** COMMENT Srcery

#+begin_src emacs-lisp
  (use-package srcery-theme
    :straight t
    :config
    (load-theme 'srcery t)
  )
#+end_src

** COMMENT Nord

#+begin_src emacs-lisp
  (use-package nord-theme
    :straight t
    :config
    (load-theme 'nord t)
  )
#+end_src

* Filetypes (Major-modes)
** Emacs-lisp
My emacs lisp mode settings.

#+begin_src emacs-lisp
(add-hook 'emacs-lisp-mode-hook
          (lambda ()
            (setq lisp-indent-offset 2
                  evil-shift-width lisp-indent-offset)
          )
)
#+end_src

** COMMENT Python

#+begin_src emacs-lisp
(add-hook 'python-mode-hook
          (lambda ()
            ;; (setq python-indent-offset 4)
            (setq indent-tabs-mode nil
                  tab-width 4  ;; how many spaces show in TAB character
                  tab-stop-list 4
                  evil-shift-width 4)
          )
)
#+end_src

** COMMENT Text-mode
[[https://stackoverflow.com/questions/69934/set-4-space-indent-in-emacs-in-text-mode][Source]]

#+begin_src emacs-lisp
  (add-hook 'text-mode-hook
            (lambda ()
              (abbrev-mode 1)
              (auto-fill-mode 1)
              (setq tab-stop-list (number-sequence 4 200 4))))
#+end_src

* Evil
** Evil itself

 #+begin_src emacs-lisp
   (use-package evil
     :straight (:depth 1)
     :init ;; tweak evil's configuration before loading it
     (setq evil-search-module 'evil-search)
     (setq evil-ex-complete-emacs-commands nil)
     (setq evil-vsplit-window-right t)
     (setq evil-split-window-below t)
     (setq evil-shift-round nil)
     (setq evil-want-C-u-scroll t)
     (setq evil-want-keybinding nil)
     ;; (setq evil-want-integration nil)
     :config ;; tweak evil after loading it
     (evil-mode 1)

     ;; example how to map a command in normal mode (called 'normal state' in evil)
     (define-key evil-normal-state-map (kbd ", w") 'evil-window-vsplit)
   )
 #+end_src

** evil-collection

#+begin_src emacs-lisp
  (use-package evil-collection
    :straight (:depth 1)
    :after evil
    ;; :straight (drag-stuff :type git :host github :repo "rejeep/drag-stuff.el"
    ;;                     :fork (:host github
    ;;                            :repo "your-name/el-patch")))
    :config
    (evil-collection-init))
#+end_src

** evil-commentary

Use =gc{motion}= to comment target or =gcc= to comment line.

#+begin_src emacs-lisp
  (use-package evil-commentary
    :straight (:depth 1)
    :after evil
    :config
    (evil-commentary-mode)
  )
#+end_src

** evil-org-mode

#+begin_src emacs-lisp
  (use-package evil-org
    :straight (:depth 1)
    :after org
    :config
    (add-hook 'org-mode-hook 'evil-org-mode)
    (add-hook 'evil-org-mode-hook
              (lambda () (evil-org-set-key-theme)))
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys)
    ;; (setq org-special-ctrl-a/e t)

    (with-eval-after-load 'evil-maps
      ;; (define-key evil-motion-state-map (kbd "SPC") nil)
      (define-key evil-motion-state-map (kbd "RET") nil)  ; отменить привязку клавиши Enter в evil-mode.
      ;; (define-key evil-motion-state-map (kbd "TAB") nil)
    )
  )
#+end_src

** Surround

#+begin_src emacs-lisp
  (use-package evil-surround
    :straight t
    :after evil
    :config
    (global-evil-surround-mode 1))
#+end_src

* Plugins
** Org-mode
*** Org-mode as major mode settings

Emacs settings which will be enabled only when org-mode will be set as a buffer
major mode:

#+begin_src emacs-lisp
  (add-hook 'org-mode-hook
            (lambda ()
              (setq fill-column 80)  ;; set textwidth to 80

              ;; Включить автоматический пренос строк (auto fill mode).
              ;; When enabled `auto-fill-function` variable is not nil.
              ;; The same as: (auto-fill-mode 1).
              (turn-on-auto-fill)
            )
  )
#+end_src

