init.el

(use-package better-defaults
  :straight t)

(setq-default indent-tabs-mode nil   ; no tab characters in files
              tab-width 4
              comment-empty-lines t  ; comment empty lines
              ;; При обращении к файлу уже открытому в буфере Emacs-а
              ;; по другому имени (по символической или жёсткой
              ;; ссылке), Emacs откроет уже существующий буфер, а не
              ;; создасть новый.
              find-file-existing-other-name t
              ;; delete-indentation t
)

(use-package async
  :straight t)

(use-package doom-themes
  :straight t
  :config
  ;; Global settings (defaults)
  (setq
    doom-themes-enable-bold nil  ; if nil, bold is universally disabled
    doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-one t)
  ;; (load-theme 'doom-gruvbox t)
  ;; (load-theme 'doom-material t)
  ;; (load-theme 'doom-peacoc t)
  ;; (load-theme 'doom-nova t)
)

(add-hook 'emacs-lisp-mode-hook
          (lambda ()
            (setq lisp-indent-offset 2
                  evil-shift-width lisp-indent-offset)
          )
)

(use-package evil
  :straight (:depth 1)
  :init ;; tweak evil's configuration before loading it
  (setq evil-search-module 'evil-search)
  (setq evil-ex-complete-emacs-commands nil)
  (setq evil-vsplit-window-right t)
  (setq evil-split-window-below t)
  (setq evil-shift-round nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-keybinding nil)
  ;; (setq evil-want-integration nil)
  :config ;; tweak evil after loading it
  (evil-mode 1)

  ;; example how to map a command in normal mode (called 'normal state' in evil)
  (define-key evil-normal-state-map (kbd ", w") 'evil-window-vsplit)
)

(use-package evil-collection
  :straight (:depth 1)
  :after evil
  ;; :straight (drag-stuff :type git :host github :repo "rejeep/drag-stuff.el"
  ;;                     :fork (:host github
  ;;                            :repo "your-name/el-patch")))
  :config
  (evil-collection-init))

(use-package evil-commentary
  :straight (:depth 1)
  :after evil
  :config
  (evil-commentary-mode)
)

(use-package evil-org
  :straight (:depth 1)
  :after org
  :config
  (add-hook 'org-mode-hook 'evil-org-mode)
  (add-hook 'evil-org-mode-hook
            (lambda () (evil-org-set-key-theme)))
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys)
  ;; (setq org-special-ctrl-a/e t)

  (with-eval-after-load 'evil-maps
    ;; (define-key evil-motion-state-map (kbd "SPC") nil)
    (define-key evil-motion-state-map (kbd "RET") nil)  ; отменить привязку клавиши Enter в evil-mode.
    ;; (define-key evil-motion-state-map (kbd "TAB") nil)
  )
)

(use-package evil-surround
  :straight t
  :after evil
  :config
  (global-evil-surround-mode 1))

(add-hook 'org-mode-hook
          (lambda ()
            (setq fill-column 80)  ;; set textwidth to 80

            ;; Включить автоматический пренос строк (auto fill mode).
            ;; When enabled `auto-fill-function` variable is not nil.
            ;; The same as: (auto-fill-mode 1).
            (turn-on-auto-fill)
          )
)

(use-package org
