README.org
*** Org-mode settings for it self
Source code block indentation / editing / syntax highlighting:
Use ~:custom~ instead of ~setq~ in ~:config~, since the former doesn't require
package.

#+begin_src emacs-lisp
  (use-package org
    :straight (:type built-in)
    ;; :init
    :custom
      ;; ------------------- Appearance (Внешний вид) -------------------------
      ;; Turn on ‘org-indent-mode’ on startup, which softly indent text
      ;; according to outline structure.
      (org-startup-indented t)

      ;; See also "org-indent.el" which does level-dependent indentation in a
      ;; virtual way, i.e. at display time in Emacs.
      (org-adapt-indentation nil)
      ;; WARNING: Seams it doesn't work with ‘org-startup-indented’.
      (org-odd-levels-only t)

      ;; Скрывать символы разметки такие как '*..*' чтобы отображать текст
      ;; жирным, или '~..~' для кода и т.д.
      (org-hide-emphasis-markers nil)

      (org-tags-column -75)  ;; Прижимать тэги с 75 колонке справа.

      ;; The maximum level for Imenu access to Org headlines.
      (org-imenu-depth 20)

      ;; Show inline images by default in org-mode
      (org-startup-with-inline-images t)
      (org-image-actual-width '(400))

      ;; ;; Строка, которая будет использована для обозначения свёрнугото блока
      ;; ;; текста. По умолчанию -- три точки.
      ;; (org-ellipsis "↴") ;; ↴, ▼, ▶, ⤵
      ;; ----------------------------------------------------------------------

      ;; --------------------- Source code blocks ----------------------------
      (org-src-fontify-natively t) ;; Fontify code in code blocks.

      ;; Edit src block buffer to the right of the current window, keeping all
      ;; other windows.
      (org-src-window-setup 'split-window-right)
      ;; (org-src-window-setup 'current-window)  ;; edit in current window

      ;; WARNING: It seems that this variable has been removed in current
      ;; versions of org-mode.
      ;; If non-nil, blank lines are removed when exiting the code edit buffer.
      (org-src-strip-leading-and-trailing-blank-lines t)

      ;; Put two spaces additional to indentation at the beginning
      ;; of the line in source blocks.
      (org-edit-src-content-indentation 2)
      (org-src-preserve-indentation nil)

      ;; If non-nil, the effect of TAB in a code block is as if it were
      ;; issued in the language major mode buffer.
      (org-src-tab-acts-natively t)
      ;; ----------------------------------------------------------------------

      ;; ---------------------------- Links -----------------------------------
      ;; Enter откроет сслыку при условии, что курсор находится на ней.
      ;; Follow org links by press Enter with point on it.
      (org-return-follows-link t) 

      ;; ;; Follow org links by press Tab with point on it.
      ;; (org-tab-follows-link t) 
      ;; ----------------------------------------------------------------------

    :config
    ;; Languages which can be evaluated in Org buffers.
    (org-babel-do-load-languages 'org-babel-load-languages '((python . t)
                                                             (emacs-lisp . t)
                                                             (shell . t)))
    :hook
    ;; (org-mode . prettify-symbols-mode)
    ;; (org-mode . (lambda () (setq prettify-symbols-alist
    ;;                              '(("[ ]" . "☐")
    ;;                                ("[X]" . "☑") ;; ✔
    ;;                                ("[-]" . "◿"))))) ;; ◪, ⬔
    (org-babel-after-execute . org-redisplay-inline-images)

  )
#+end_src

Org 9.2 introduced a new template expansion mechanism, combining
~org-insert-structure-template~ bound to =C-c C-,=.  The previous
~easy-templates~ mechanism (=<s Tab=) should be enabled manualy:

#+begin_src emacs-lisp
  (use-package org-tempo
    :straight (:type built-in)
    :after org
    :config
    ;; Type `<el Tab` to insert emacs-lisp source code block.
    ;; And type `<sh Tab` to insert bash source block.
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
  )
#+end_src
 
*** Org Superstar (Org Bullets)
[[https://github.com/integral-dw/org-superstar-mode][Source]]
#+begin_src emacs-lisp
  (use-package org-superstar
    :straight t
    :hook (org-mode . org-superstar-mode)
    ;; :custom
    ;; (org-bullets-bullet-list '("⁖"))
  )
#+end_src

** COMMENT Sublimity

#+begin_src emacs-lisp
  (use-package sublimity
    :straight t
    ;; :custom
    ;;   (sublimity-scroll-weight 10)
    ;;   (sublimity-scroll-drift-length 5)
    :config 
      (require 'sublimity)
      (require 'sublimity-scroll)
      ;; (require 'sublimity-map)
      ;; (require 'sublimity-attractive)
      ;; (sublimity-map-set-delay 3)
      (sublimity-mode 1)
  )
  ;; (sublimity-mode 1)
#+end_src

** COMMENT Visual tweaks

Rainbow delimiters:

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :straight (:depth 1)
    :init
    (add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
    (add-hook 'org-mode-hook #'rainbow-delimiters-mode)
  )
#+end_src

Display ugly ^L page breaks as tidy horizontal lines.

#+begin_src emacs-lisp
  (use-package page-break-lines
    :straight (:depth 1)
    ;; :init
    :config
    (global-page-break-lines-mode)
    ;; (page-break-lines-modes)
  )
#+end_src

#+begin_src emacs-lisp
  (use-package all-the-icons
    :straight (:depth 1))
#+end_src
** COMMENT ob-async
[[https://github.com/astahlman/ob-async][Source]]
Enables asynchronous execution of org-babel src blocks.

#+begin_src emacs-lisp
  (use-package ob-async
    :straight t)
#+end_src

* COMMENT Retangle =init.el= file if source is changed

The modification time of the =init.el= file.

#+begin_src emacs-lisp
(file-attribute-modification-time (file-attributes init-file))
#+end_src

Check if one file is newer then another.

#+begin_src emacs-lisp
(file-newer-than-file-p config-org-file init-file)
(org-babel-tangle-file config-org-file)
(add-hook 'kill-emacs-hook 'my/config-update)
#+end_src

#+begin_src emacs-lisp
(progn
  (require 'ob-tangle)
  (message "Tangling %s → %s." config-org-file init-file)
)
#+end_src

* Asynchronous tangle emacs config on save

Asynchronous tangle, using =emacs-async=, an org file with emacs settings.
Closely inspired by [[https://github.com/dieggsy/dotfiles/tree/cc10edf7701958eff1cd94d4081da544d882a28c/emacs.d#dotfiles][this example]]

TODO: работает, но не показывает рузультат!

#+begin_src emacs-lisp
(with-eval-after-load 'org
  (defvar my/show-async-tangle-results nil
    "Keep *emacs* async buffers around for later inspection.")

  (defvar my/show-async-tangle-time nil
    "Show the time spent tangling the file.")

  (defun my/config-tangle ()
    "Tangles the org file asynchronously."
    ;; (when (file-newer-than-file-p config-org-file init-file))
      (my/async-babel-tangle config-org-file))

  (defun my/async-babel-tangle (org-file)
    "Tangles the org file asynchronously."
    (let ((init-tangle-start-time (current-time))
          (file (buffer-file-name))
          (async-quiet-switch "-q"))
      (async-start
        `(lambda ()
           (require 'org)
           (org-babel-tangle-file ,org-file))
        ;; (unless *show-async-tangle-results*
        ;;   `(lambda (result)
        ;;      (if result
        ;;          (message "SUCCESS: %s successfully tangled (%.2fs)."
        ;;                   ,org-file
        ;;                   (float-time (time-subtract (current-time)
        ;;                                              ',init-tangle-start-time)))
        ;;        (message "ERROR: %s as tangle failed." ,org-file))))
      )
    )
  )
)

;; (add-to-list
;;   'safe-local-variable-values
;;   '(eval add-hook 'after-save-hook #'my/async-babel-tangle 'append 'local))

(add-hook 'after-save-hook #'my/config-tangle)
#+end_src

* ~(provide 'init.el)~
This concludes the =early-init.el= file.

#+begin_src emacs-lisp
(provide 'init.el)
;;; init.el ends here
#+end_src
