init.el
  :straight (:type built-in)
  ;; :init
  :custom
    ;; ------------------- Appearance (Внешний вид) -------------------------
    ;; Turn on ‘org-indent-mode’ on startup, which softly indent text
    ;; according to outline structure.
    (org-startup-indented t)

    ;; See also "org-indent.el" which does level-dependent indentation in a
    ;; virtual way, i.e. at display time in Emacs.
    (org-adapt-indentation nil)
    ;; WARNING: Seams it doesn't work with ‘org-startup-indented’.
    (org-odd-levels-only t)

    ;; Скрывать символы разметки такие как '*..*' чтобы отображать текст
    ;; жирным, или '~..~' для кода и т.д.
    (org-hide-emphasis-markers nil)

    (org-tags-column -75)  ;; Прижимать тэги с 75 колонке справа.

    ;; The maximum level for Imenu access to Org headlines.
    (org-imenu-depth 20)

    ;; Show inline images by default in org-mode
    (org-startup-with-inline-images t)
    (org-image-actual-width '(400))

    ;; ;; Строка, которая будет использована для обозначения свёрнугото блока
    ;; ;; текста. По умолчанию -- три точки.
    ;; (org-ellipsis "↴") ;; ↴, ▼, ▶, ⤵
    ;; ----------------------------------------------------------------------

    ;; --------------------- Source code blocks ----------------------------
    (org-src-fontify-natively t) ;; Fontify code in code blocks.

    ;; Edit src block buffer to the right of the current window, keeping all
    ;; other windows.
    (org-src-window-setup 'split-window-right)
    ;; (org-src-window-setup 'current-window)  ;; edit in current window

    ;; WARNING: It seems that this variable has been removed in current
    ;; versions of org-mode.
    ;; If non-nil, blank lines are removed when exiting the code edit buffer.
    (org-src-strip-leading-and-trailing-blank-lines t)

    ;; Put two spaces additional to indentation at the beginning
    ;; of the line in source blocks.
    (org-edit-src-content-indentation 2)
    (org-src-preserve-indentation nil)

    ;; If non-nil, the effect of TAB in a code block is as if it were
    ;; issued in the language major mode buffer.
    (org-src-tab-acts-natively t)
    ;; ----------------------------------------------------------------------

    ;; ---------------------------- Links -----------------------------------
    ;; Enter откроет сслыку при условии, что курсор находится на ней.
    ;; Follow org links by press Enter with point on it.
    (org-return-follows-link t) 

    ;; ;; Follow org links by press Tab with point on it.
    ;; (org-tab-follows-link t) 
    ;; ----------------------------------------------------------------------

  :config
  ;; Languages which can be evaluated in Org buffers.
  (org-babel-do-load-languages 'org-babel-load-languages '((python . t)
                                                           (emacs-lisp . t)
                                                           (shell . t)))
  :hook
  ;; (org-mode . prettify-symbols-mode)
  ;; (org-mode . (lambda () (setq prettify-symbols-alist
  ;;                              '(("[ ]" . "☐")
  ;;                                ("[X]" . "☑") ;; ✔
  ;;                                ("[-]" . "◿"))))) ;; ◪, ⬔
  (org-babel-after-execute . org-redisplay-inline-images)

)

(use-package org-tempo
  :straight (:type built-in)
  :after org
  :config
  ;; Type `<el Tab` to insert emacs-lisp source code block.
  ;; And type `<sh Tab` to insert bash source block.
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
)

(use-package org-superstar
  :straight t
  :hook (org-mode . org-superstar-mode)
  ;; :custom
  ;; (org-bullets-bullet-list '("⁖"))
)

(with-eval-after-load 'org
  (defvar my/show-async-tangle-results nil
    "Keep *emacs* async buffers around for later inspection.")

  (defvar my/show-async-tangle-time nil
    "Show the time spent tangling the file.")

  (defun my/config-tangle ()
    "Tangles the org file asynchronously."
    ;; (when (file-newer-than-file-p config-org-file init-file))
      (my/async-babel-tangle config-org-file))

  (defun my/async-babel-tangle (org-file)
    "Tangles the org file asynchronously."
    (let ((init-tangle-start-time (current-time))
          (file (buffer-file-name))
          (async-quiet-switch "-q"))
      (async-start
        `(lambda ()
           (require 'org)
           (org-babel-tangle-file ,org-file))
        ;; (unless *show-async-tangle-results*
        ;;   `(lambda (result)
        ;;      (if result
        ;;          (message "SUCCESS: %s successfully tangled (%.2fs)."
        ;;                   ,org-file
        ;;                   (float-time (time-subtract (current-time)
        ;;                                              ',init-tangle-start-time)))
        ;;        (message "ERROR: %s as tangle failed." ,org-file))))
      )
    )
  )
)

;; (add-to-list
;;   'safe-local-variable-values
;;   '(eval add-hook 'after-save-hook #'my/async-babel-tangle 'append 'local))

(add-hook 'after-save-hook #'my/config-tangle)

(provide 'init.el)
;;; init.el ends here
